import React from "react";
import { BookDescriptionWrapper } from "./detailStyle";

const BookDescription = () => {
  return (
    <BookDescriptionWrapper>
      <h3 className="title">책소개</h3>
      <div className="description">
        `공감의 작가 강세형, 60만 독자의 기다림 속 3년 만의 신작 에세이 “겨우
        한고비 넘어온 것 같은데 또다시 시작되는 그 수많은 하루하루를, 다들
        어떻게 견디며 살아가고 있는 걸까?” 어제는 조금 우울했지만 오늘은 또
        그럭저럭 괜찮은 하루를 보내는 당신에게, 강세형 작가의 위로가 도착했다.
        바로, ‘희한한’ 위로. 60만 독자의 사랑을 받은 강세형 작가는 『나는 아직,
        어른이 되려면 멀었다』, 『나는 다만, 조금 느릴 뿐이다』, 『나를,
        의심한다』 등의 책을 통해 때로는 위안을, 때로는 가슴 먹먹한 감동을
        전해왔다. 최근 몇 년 제법 힘겨운 시간을 보낸 그녀는 ‘다들 어떻게 견디고
        있는 걸까?’ 궁금해지기 시작했고, 스스로를 위로하기 위해, 조금이나마 힘을
        찾기 위해 다시 글을 쓰기 시작했다. 그렇게 쓴 글들은 오히려 각자의 역량껏
        이미 최선을 다해 버티고 있는 많은 이들에게 ‘희한한’ 위로가 되어준다.
        어떻게든 애를 써 일어나려 할 때 누군가 다시 짓눌러 주저앉히는 것 같은
        삶. 그때 작가는 “어떻게든 되겠지” 하는 친구의 농담 앞에서, 낯선 이의
        무심한 배려 앞에서, 아무 생각 없이 틀어놓은 영화 앞에서 울고 웃고
        위로받았다. “어쩌면 위로는 정말 그런 걸지도 모르겠다. 작정하고 내뱉어진
        의도된 말에서보다는 엉뚱하고 희한한 곳에서 찾아오는 것.”이라는
        단순명료한 깨우침에 그녀는 슬럼프와 위기가 찾아온 이들에게, (그것을
        극복하게 해주진 못해도) 그 시간을 함께 보낼 작은 책을 놓아둔다. 『희한한
        위로』라는 작은 책을. “이 책이, 당신의 위로를 발견하는 데에도 도움이 될
        수 있다면 좋겠다”는 바람과 함께.`
      </div>
    </BookDescriptionWrapper>
  );
};

export default BookDescription;
